SOAPMessage_Fix1.xml

<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			soap:mustUnderstand="1">
			<wsu:Timestamp wsu:Id="TS-85518453-34f2-49d2-aab4-4b81295e16c2">
				<wsu:Created>2017-10-26T01:02:48.530Z</wsu:Created>
				<wsu:Expires>2017-10-26T01:07:48.530Z</wsu:Expires>
			</wsu:Timestamp>
			<saml:Assertion xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion"
				AssertionID="AID_ASLDFKAEFIJAS" IssueInstant="2017-10-19T21:00:00Z"
				Issuer="librarian" MajorVersion="1" MinorVersion="1">
				<saml:Conditions NotBefore="2017-10-19T20:00:00Z"
					NotOnOrAfter="2017-10-19T22:00:00Z" />
				<saml:AuthenticationStatement
					AuthenticationInstant="2017-10-19T21:00:00Z" AuthenticationMethod="urn:ietf:rfc:3075">
					<saml:Subject>
						<saml:NameIdentifier
							Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified">CN=masteruser, OU=Library</saml:NameIdentifier>
						<saml:SubjectConfirmation>
							<saml:ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:holder-of-key
							</saml:ConfirmationMethod>
							<dsig:KeyInfo xmlns:dsig="http://www.w3.org/2000/09/xmldsig#">
								<dsig:X509Data>
									<dsig:X509Certificate>adflkafdlk....asdlfkjalsfd
									</dsig:X509Certificate>
									<dsig:X509IssuerSerial>
										<dsig:X509IssuerName>CN=masteruser, OU=Library
										</dsig:X509IssuerName>
										<dsig:X509SerialNumber>9345872435</dsig:X509SerialNumber>
									</dsig:X509IssuerSerial>
									<dsig:X509SubjectName>CN=masteruser, OU=Library
									</dsig:X509SubjectName>
									<dsig:X509SKI>245782495alkdfad</dsig:X509SKI>
								</dsig:X509Data>
							</dsig:KeyInfo>
						</saml:SubjectConfirmation>
					</saml:Subject>
				</saml:AuthenticationStatement>
				<saml:AttributeStatement>
					<saml:Subject>
						<saml:NameIdentifier
							Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified">CN=masteruser, OU=Library</saml:NameIdentifier>
						<saml:SubjectConfirmation>
							<saml:ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:holder-of-key
							</saml:ConfirmationMethod>
							<dsig:KeyInfo xmlns:dsig="http://www.w3.org/2000/09/xmldsig#">
								<dsig:X509Data>
									<dsig:X509Certificate>adflkafdlk....asdlfkjalsfd
									</dsig:X509Certificate>
									<dsig:X509IssuerSerial>
										<dsig:X509IssuerName>CN=masteruser, OU=Library
										</dsig:X509IssuerName>
										<dsig:X509SerialNumber>9345872435</dsig:X509SerialNumber>
									</dsig:X509IssuerSerial>
									<dsig:X509SubjectName>CN=masteruser, OU=Library
									</dsig:X509SubjectName>
									<dsig:X509SKI>245782495alkdfad</dsig:X509SKI>
								</dsig:X509Data>
							</dsig:KeyInfo>
						</saml:SubjectConfirmation>
					</saml:Subject>
					<saml:Attribute AttributeName="dn"
						AttributeNamespace="http://www.example.org/saml/2000/01/attributes">
						<saml:AttributeValue>uid=masteruser, ou=Library
						</saml:AttributeValue>
					</saml:Attribute>
				</saml:AttributeStatement>
				<dsig:Signature xmlns:dsig="http://www.w3.org/2000/09/xmldsig#">
					<dsig:SignedInfo>
						<dsig:CanonicalizationMethod
							Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						<dsig:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
						<dsig:Reference URI="#AID_ASLDFKAEFIJAS">
							<dsig:Transforms>
								<dsig:Transform
									Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" />
								<dsig:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
							</dsig:Transforms>
							<dsig:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
							<dsig:DigestValue>P235423ADF92485FD=</dsig:DigestValue>
						</dsig:Reference>
					</dsig:SignedInfo>
					<dsig:SignatureValue>ADSLFJ923482LIJF4984FJ</dsig:SignatureValue>
					<dsig:KeyInfo>
						<dsig:X509Data>
							<dsig:X509Certificate>MISDCKLMWEIJ2938J892</dsig:X509Certificate>
							<dsig:X509IssuerSerial>
								<dsig:X509IssuerName>UID=librarian, OU=Faculty, O=School
								</dsig:X509IssuerName>
								<dsig:X509SerialNumber>34604983059</dsig:X509SerialNumber>
							</dsig:X509IssuerSerial>
							<dsig:X509SubjectName>UID=librarian, OU=Faculty, O=School
							</dsig:X509SubjectName>
							<dsig:X509SKI>f/209aldfj209rjf29</dsig:X509SKI>
						</dsig:X509Data>
					</dsig:KeyInfo>
				</dsig:Signature>
			</saml:Assertion>
			<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
				Id="SIG-c3d8d0d9-62c3-4141-ba27-21d7294024bb">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod
						Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
						<ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"
							PrefixList="soap" />
					</ds:CanonicalizationMethod>
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
					<ds:Reference URI="#TS-85518453-34f2-49d2-aab4-4b81295e16c2">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<ec:InclusiveNamespaces
									xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="wsse soap" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>XD5SUNj7GKhDrhtkQA/VLQTeQqU=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#_d62fd88c-2d86-4fb4-9933-96cc98a3d320">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>RLqGMTOobPowTbVZ5VR6PCHPLpM=</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue>fLLxJsuyfc2m60M6uvCIzbNMuggLXvLz8ljJQgIyoyF4NWLUNeVzTHUq+QxNu4pyq4o43ABaSBELm9sPmBXaq0lg/xO6EFQrqYhWgzuT/f0BZrZ1AaaRTWzw3QiB+hdNa47/LlxkthJ1cPaHmpx6Lq/7y1nlEt7F8JW3E0d2JN7avzkDSC8YysxqUTW5A2dlnOkqBXOxaE6BFYhhd574cznABQkASIPTHMuXMJh/S/3V1hUlzAAYvg+FM24ga5aw4H/a3u51Jf44Kn+JnIZHyRNJFyhkBNc+nUS48arQ7XGFrl8awI4h6Zcfr7z8gfgSMKfPucnSK3aEdgzXVLPCaQ==
				</ds:SignatureValue>
				<ds:KeyInfo Id="KI-1bd73691-deba-4d5f-86f5-6509281e36ff">
					<wsse:SecurityTokenReference
						xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
						xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
						xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
						wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV1.1"
						wsu:Id="STR-aae5d744-4f7f-49dc-9662-39c1c42c5f8b">
						<wsse:KeyIdentifier
							ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.0#SAMLAssertionID">AID_ASLDFKAEFIJAS</wsse:KeyIdentifier>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
			</ds:Signature>
		</wsse:Security>
	</soap:Header>
	<soap:Body
		xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
		wsu:Id="_d62fd88c-2d86-4fb4-9933-96cc98a3d320">
		<ns2:NewOperation xmlns:ns2="http://www.example.org/BookService/">
			<in>_newOperation_in-640412423</in>
		</ns2:NewOperation>
	</soap:Body>
</soap:Envelope>