SOAPMessage_Fix1_Try2.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap:Envelope xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
	<soap:Header>
		<wsse:Security
			xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
			xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
			soap:mustUnderstand="1">
			<wsu:Timestamp wsu:Id="TS-15f73a49-8038-4820-9929-2d9c3e44be48">
				<wsu:Created>2017-10-26T18:34:06.494Z</wsu:Created>
				<wsu:Expires>2017-10-26T18:39:06.494Z</wsu:Expires>
			</wsu:Timestamp>
			<saml:Assertion xmlns:saml="urn:oasis:names:tc:SAML:1.0:assertion"
				AssertionID="AID_ASLDFKAEFIJAS" IssueInstant="2017-10-19T21:00:00Z"
				Issuer="librarian" MajorVersion="1" MinorVersion="1">
				<saml:Conditions NotBefore="2017-10-19T20:00:00Z"
					NotOnOrAfter="2017-10-19T22:00:00Z" />
				<saml:AuthenticationStatement
					AuthenticationInstant="2017-10-19T21:00:00Z" AuthenticationMethod="urn:ietf:rfc:3075">
					<saml:Subject>
						<saml:NameIdentifier
							Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified">CN=masteruser, OU=Library</saml:NameIdentifier>
						<saml:SubjectConfirmation>
							<saml:ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:holder-of-key
							</saml:ConfirmationMethod>
							<dsig:KeyInfo xmlns:dsig="http://www.w3.org/2000/09/xmldsig#">
								<dsig:X509Data>
									<dsig:X509Certificate>adflkafdlk....asdlfkjalsfd
									</dsig:X509Certificate>
									<dsig:X509IssuerSerial>
										<dsig:X509IssuerName>CN=masteruser, OU=Library
										</dsig:X509IssuerName>
										<dsig:X509SerialNumber>9345872435</dsig:X509SerialNumber>
									</dsig:X509IssuerSerial>
									<dsig:X509SubjectName>CN=masteruser, OU=Library
									</dsig:X509SubjectName>
									<dsig:X509SKI>245782495alkdfad</dsig:X509SKI>
								</dsig:X509Data>
							</dsig:KeyInfo>
						</saml:SubjectConfirmation>
					</saml:Subject>
				</saml:AuthenticationStatement>
				<saml:AttributeStatement>
					<saml:Subject>
						<saml:NameIdentifier
							Format="urn:oasis:names:tc:SAML:1.1:nameid-format:unspecified">CN=masteruser, OU=Library</saml:NameIdentifier>
						<saml:SubjectConfirmation>
							<saml:ConfirmationMethod>urn:oasis:names:tc:SAML:1.0:cm:holder-of-key
							</saml:ConfirmationMethod>
							<dsig:KeyInfo xmlns:dsig="http://www.w3.org/2000/09/xmldsig#">
								<dsig:X509Data>
									<dsig:X509Certificate>adflkafdlk....asdlfkjalsfd
									</dsig:X509Certificate>
									<dsig:X509IssuerSerial>
										<dsig:X509IssuerName>CN=masteruser, OU=Library
										</dsig:X509IssuerName>
										<dsig:X509SerialNumber>9345872435</dsig:X509SerialNumber>
									</dsig:X509IssuerSerial>
									<dsig:X509SubjectName>CN=masteruser, OU=Library
									</dsig:X509SubjectName>
									<dsig:X509SKI>245782495alkdfad</dsig:X509SKI>
								</dsig:X509Data>
							</dsig:KeyInfo>
						</saml:SubjectConfirmation>
					</saml:Subject>
					<saml:Attribute AttributeName="dn"
						AttributeNamespace="http://www.example.org/saml/2000/01/attributes">
						<saml:AttributeValue>uid=masteruser, ou=Library
						</saml:AttributeValue>
					</saml:Attribute>
				</saml:AttributeStatement>
				<dsig:Signature xmlns:dsig="http://www.w3.org/2000/09/xmldsig#">
					<dsig:SignedInfo>
						<dsig:CanonicalizationMethod
							Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						<dsig:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
						<dsig:Reference URI="#AID_ASLDFKAEFIJAS">
							<dsig:Transforms>
								<dsig:Transform
									Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature" />
								<dsig:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
							</dsig:Transforms>
							<dsig:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
							<dsig:DigestValue>P235423ADF92485FD=</dsig:DigestValue>
						</dsig:Reference>
					</dsig:SignedInfo>
					<dsig:SignatureValue>ADSLFJ923482LIJF4984FJ</dsig:SignatureValue>
					<dsig:KeyInfo>
						<dsig:X509Data>
							<dsig:X509Certificate>MISDCKLMWEIJ2938J892</dsig:X509Certificate>
							<dsig:X509IssuerSerial>
								<dsig:X509IssuerName>UID=librarian, OU=Faculty, O=School
								</dsig:X509IssuerName>
								<dsig:X509SerialNumber>34604983059</dsig:X509SerialNumber>
							</dsig:X509IssuerSerial>
							<dsig:X509SubjectName>UID=librarian, OU=Faculty, O=School
							</dsig:X509SubjectName>
							<dsig:X509SKI>f/209aldfj209rjf29</dsig:X509SKI>
						</dsig:X509Data>
					</dsig:KeyInfo>
				</dsig:Signature>
			</saml:Assertion>
			<ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#"
				Id="SIG-888366bc-19fd-4108-a8de-71e64ca0bc3f">
				<ds:SignedInfo>
					<ds:CanonicalizationMethod
						Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
						<ec:InclusiveNamespaces xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#"
							PrefixList="soap" />
					</ds:CanonicalizationMethod>
					<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1" />
					<ds:Reference URI="#TS-15f73a49-8038-4820-9929-2d9c3e44be48">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#">
								<ec:InclusiveNamespaces
									xmlns:ec="http://www.w3.org/2001/10/xml-exc-c14n#" PrefixList="wsse soap" />
							</ds:Transform>
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>WV6j2eX2IWPhhCiToSW/fdwZYd8=</ds:DigestValue>
					</ds:Reference>
					<ds:Reference URI="#_80cd6f7c-91e5-4f2b-9f12-e6ce9e3b777c">
						<ds:Transforms>
							<ds:Transform Algorithm="http://www.w3.org/2001/10/xml-exc-c14n#" />
						</ds:Transforms>
						<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1" />
						<ds:DigestValue>1+jdhEDkIGdqHrwq55GWIdCmtqs=</ds:DigestValue>
					</ds:Reference>
				</ds:SignedInfo>
				<ds:SignatureValue>NLxwrkavjzpVbGp6sG9L1VomX1ABRPXHt1+8ilWVydu3hdU7zwJjzF3w5KSpsyI1s9zd0MBzf3i0erMMO52Zca8v0gtVnutbd3nprIdOBZPNVKEqggCyEbdhQpM6o1Gt7gwQsJmRx/vnjLsyg0Djf/K19SoS2VHAHYwuR3oi02SJ5tkelNQeKaqPqsSs5iyOIVcVOnKzokNGSJKwRQaOljr4AdlQaaVcQ1LNkAGgfoCx4hnjzFZdbp3sBaljym2mtah+rP5aNiQk21ByCPrbgxthC8iAuUtFY/ujhfk1hIeq9bKxCvMMKt1hpWgDOlfO06Gjcko2Kij4xxGiD9dKMQ==
				</ds:SignatureValue>
				<ds:KeyInfo Id="KI-4749ebd8-a112-44a9-b10d-72e8142482c2">
					<wsse:SecurityTokenReference
						xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"
						xmlns:wsse11="http://docs.oasis-open.org/wss/oasis-wss-wssecurity-secext-1.1.xsd"
						xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
						wsse11:TokenType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.1#SAMLV1.1"
						wsu:Id="STR-714a52ab-2a00-46e3-b7f7-dff551ec6a2b">
						<wsse:KeyIdentifier
							ValueType="http://docs.oasis-open.org/wss/oasis-wss-saml-token-profile-1.0#SAMLAssertionID">AID_ASLDFKAEFIJAS</wsse:KeyIdentifier>
					</wsse:SecurityTokenReference>
				</ds:KeyInfo>
			</ds:Signature>
		</wsse:Security>
	</soap:Header>
	<soap:Body
		xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd"
		wsu:Id="_80cd6f7c-91e5-4f2b-9f12-e6ce9e3b777c">
		<ns2:NewOperation xmlns:ns2="http://www.example.org/BookService/">
			<in>_newOperation_in-640412423</in>
		</ns2:NewOperation>
	</soap:Body>
</soap:Envelope>